# SurfaceResolutionOutOfRange Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EnergyAnalysisFailures..::..SurfaceResolutionOutOfRange Property
BuiltInFailures..::..EnergyAnalysisFailures Class See Also
---
Pixel size is out of range.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SurfaceResolutionOutOfRange { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SurfaceResolutionOutOfRange As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SurfaceResolutionOutOfRange {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace